In [3]:
import numpy as np
import pandas as pd

In [4]:
csv_path="schools.csv"
schools_df = pd.read_csv(csv_path)
schools_df.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
csv_path="students.csv"
students_df = pd.read_csv(csv_path)
students_df.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [7]:
students_df.count()
clean_students_df = students_df.dropna(how="any")
clean_students_df.count()

Student ID       39170
name             39170
gender           39170
grade            39170
school           39170
reading_score    39170
math_score       39170
dtype: int64

In [15]:
schools_df.count()
clean_schools_df = schools_df.dropna(how="any")
clean_schools_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [19]:
schools_df = schools_df.rename(columns={"school_name":"school"})
schools_df.head()

   School ID                 school      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [21]:
schools_df.sum("school","size","budget")

ValueError: No axis named size for object type <class 'pandas.core.frame.DataFrame'>